# Напишите программу, которая получает на вход строку и подсчитывает, 
# сколько раз в ней встречается каждый символ (независимо от регистра).
# Результат нужно вывести без фигурных скобок
# Пример. 
# ввод:
# Абракадабра
# Вывод
# а-5 б-2 д-1 к-1 р-2
from itertools import count

n = input().lower()
dic = {}

for i in range(len(n)):
    dic[n[i]] = n.count(n[i])

print(dic)